backend/load_tests/load_test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 600
      arrivalRate: 50
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login and Browse"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "owner@test.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - get:
          url: "/api/sales/history"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - get:
          url: "/api/inventory?outletId=outlet1"
          headers:
            Authorization: "Bearer {{ token }}"